{
  "Messages": {
    "Invalid user": "I could not find a user by the name of `{0}`.",
    "Invalid role": "I could not find a role with the name `{0}`.",
    "Invalid message": "I cannot send an empty message.",
    "Invalid ac/pc prefix": "I am not able to use the same prefix for both autochannels and permachannels.",
    "Invalid ar/pr prefix": "I am not able to use the same prefix for both autoroles and permaroles.",


    "Channel no permission":
      "It appears you try to use either Autochannel or Permachannel on your server `{0}`, but you have not given me permission to be able to manage channels.
    Either remove the prefix from `{1}` or give me the `Manage channels` permission.",


    "Command invalid permissions": "I'm unable to do that. You lack the required permissions for this.",
    "Command invalid arguments":
      "Ehmm... I think you made a mistake somewhere. Try using `{0}help` if you forgot the syntax.",
    "Command invalid": "Sorry, I don't know what to do with that. Use `{0}help` if you need a list of my commands.",


    "Autochannel default":
      "Autochannels are a means to keeping your server clean and don't have unnecessary channels like 'voice 1, voice 2, etc'.
    These autochannels are voice channels that have a prefix in their name, so I can recognize them.
    When a user joins such a voice channel, I will generate a new voice channel with the same permissions and settings
    in the category the autochannel is in.
    I will also give the user permission to modify the channel.
    Once everything's done I will move the user to the new channel.
    When all users have left the generated voice channel, I will remove it.

    When setting up an autochannel, you need to make sure I have at least the `manage channels` permission.
    If you never changed my standard permissions, I should have the `administrator` permission, which works just as well
    .
    Create a channel with the autochannel prefix (you can get this through `/autochannel prefix`) followed by a name of your choosing.
You can set-up your own prefix for autochannels with `/autochannel prefix set <prefix>`.

You can customize the name generated channels have with `/autochannel name set <name>`.
You can add `{0}` to fill in the possessive form of the user's name.
Example:
/autochannel name set {0} channel
Result -> D-Kay's channel",
		"Autochannel prefix default": "The current autochannel prefix is `{0}`.
You can check 'http://unicode.org/emoji/charts/full-emoji-list.html' for icons to use in the prefix.",
		"Autochannel prefix set": "The new autochannel prefix is `{0}`.",
		"Autochannel name default": "The current name for auto generated channels is `{0}`.",
		"Autochannel name set": "The new name for auto generated channels is '{0}'.",
		"Autochannel delete": "I have removed any voice channels I could find on your server that had `{0}` as name.",

		
		"Permachannel default": "Permachannels are for when you want users to be able to have their own channels without having to bother admins.
These permachannels are voice channels that have a prefix in their name, so I can recognize them.
When a user joins such a voice channel, I will generate a new voice channel with the same permissions and settings in the category the permachannel is in.
I will also give the user permission to modify the channel.
Once everything's done I will move the user to the new channel.
Though, unlike autochannels, I will not remove these channels.

When setting up a permachannel, you need to make sure I have at least the `manage channels` permission.
If you never changed my standard permissions, I should have the `administrator` permission, which works just as well.
Create a channel with the permachannel prefix (you can get this through `/permachannel prefix`) followed by a name of your choosing.
You can set-up your own prefix for permachannels with `/permachannel prefix set <prefix>`.

You can customize the name generated channels have with `/permachannel name set <name>`.
You can add `{0}` to fill in the possessive form of the user's name.
Example:
/permachannel name set {0} channel
Result -> D-Kay's channel",
		"Permachannel prefix default": "The current permachannel prefix for this server is '{0}'.
You can check 'http://unicode.org/emoji/charts/full-emoji-list.html' for icons to use in the prefix.",
		"Permachannel prefix set": "The new permachannel prefix is '{0}'.",
		"Permachannel name default": "The current name for perma generated channels is `{0}`.",
		"Permachannel name set": "The new name for perma generated channels is '{0}'.",

		
		"Autorole default": "Autoroles are roles that are temporary granted when a user starts playing a game, and removed when the user stops playing that game.

When setting up autoroles, you need to make sure I have at least the `manage roles` permission.
If you never changed my standard permissions, I should have the `administrator` permission, which works just as well.
Create a role with the autorole prefix (you can get this through `/autorole prefix`) followed by the exact name of the game as it would appear in the status of a user.
You can set-up your own prefix for autoroles with `/autorole prefix set <prefix>`.",
		"Autorole prefix default": "The current autorole prefix is `{0}`.
You can check 'http://unicode.org/emoji/charts/full-emoji-list.html' for icons to use in the prefix.",
		"Autorole prefix set": "The new autorole prefix is `{0}`.",

		
		"Permarole default": "Permaroles are roles that are permanently granted when a user starts playing a game.

When setting up permaroles, you need to make sure I have at least the `manage roles` permission.
If you never changed my standard permissions, I should have the `administrator` permission, which works just as well.
Create a role with the permarole prefix (you can get this through `/permarole prefix`) followed by the exact name of the game as it would appear in the status of a user.
You can set-up your own prefix for permaroles with `/permarole prefix set <prefix>`.",
		"Permarole prefix default": "The current permarole prefix for this server is `{0}`.
You can check 'http://unicode.org/emoji/charts/full-emoji-list.html' for icons to use in the prefix.",
		"Permarole prefix set": "The new permarole prefix is `{0}`.",

		
		"RoleIgone default on": "You are not registered to gain either ",
		"RoleIgone default off": "You are registered to be assigned both auto- and permaroles.",
		"RoleIgone is on": "You already do not receive automated roles.",
		"RoleIgone is off": "You do not receive automated roles.",
		"RoleIgone turned on": "You no longer will be assigned automated roles.",
		"RoleIgone turned off": "You are registered to receive automated roles.",

		
		"Birthday default": "Hooray! It's our little {0} birthday!

Happy Birthday to You :notes:
Happy Birthday to You
Happy Birthday Dear {1} :notes:
Happy Birthday to You.

From good friends and true, :notes:
From old friends and new,
May good luck go with you, :notes:
And happiness too.",


		"Invite default": "You can invite me to your server with this link: https://discordapp.com/oauth2/authorize?client_id=286972781273546762&scope=bot&permissions=8.
For more info on me, go take a look at https://discordbots.org/bot/286972781273546762, or use /help in any of the discord servers I'm in.
If you're in need of support, come join my support server at 'https://discord.gg/YFqUMDT'.",


		"Kill default": "Come here {0}. We're gonna have some fun...",
		"Kill self": "Why would I kill myself?",
		"Kill creator": "How dare you to order me to kill {0}!
I should kill YOU for even thinking of something like that!",


		"Language default": "{1} is currently set to `{0}`.
These are the languages I currently support: {2}.
Be warry translations can be under construction and may contain messages that still require translating.
If you want your language to be supported or help improve an already existing translation, come to my support server.",
		"Language unsupported": "`{0}` is not a supported language.",
		"Language set": "The language for {1} was set to `{0}`.",

		
		"Music exception": "Something went wrong. Come to the support server if this problem persists.",
		"Music not active": "I'm currently not playing any music.",
		
		"Music connection exists": "I am already in a voice channel.",
		"Music connection none": "I am currently not in a voice channel.",
		"Music connection same": "I am already in the same voice channel as you.",
		"Music connection different": "You must be in the same voice channel as me to be able to do this.",
		"Music channel none": "You must be in a voice channel to listen to music.",
		"Music channel same": "You must be in the same voice channel as me to be able to do this.",
		
		"Music search": "Searching for `{0}`...",
		"Music invalid song": "I could not find a valid song to play.",
		"Music now playing": "Now playing `{0}` requested by {1}",
		
		"Music paused": "Music player is paused.",
		"Music already paused": "The music player is already paused.",
		"Music resumed": "Music player is un-paused.",
		"Music not paused": "The music player is not paused.",
		
		"Music current": "Now playing `{0}`.",
		"Music queued song": "Queued #{0} **{1}** (`{2}`).",
		"Music queued playlist": "Queued {0} songs.",
		"Music queue empty": "There is no music in the queue. Add a song to start listening to music.",
		"Music queue cleared": "Queue cleared :ok_hand:.",
		"Music queue item": "#{0}  **{1}** (`{2}`).",
		"Music queue remaining": "There are {0} more songs in queue.",
		
		"Music skipped": "Skipped `{0}` song(s).",
		"Music shuffling": "Shuffling...",
		"Music shuffled": "The queue has been shuffled.",
		
		"Music stop command": "The music player was stopped.",
		"Music stop channel": "The music player was stopped. 
All users have left the voice channel.",

		"Music volume": "Music volume was changed to {volume}.",

		
		"Pick default": "Choice for {0}",

		
		"Praise creator": "Please raise your hands for my wonderful creator *(and my future husband)*, D-Kay :heart:.",

		
		"Command prefix default": "The prefix for {1} is `{0}`.",
		"Command prefix set": "The prefix for {1} was changed to `{0}`.",
		
		"Command custom list": "These are the custom commands for this server:

{0}",
		"Command custom default": "There are {0} custom commands on this server.

To run a custom command, simply use this server's command prefix (for the sake of ease, we will say that it is `/`) followed by the command title.
Example:
`/say hi`
-> Hi.

You can add a custom command with `/command custom add <command title> <response>`.
If you want the command title to exist of multiple words, combine them withing double quotes (i.e. \"say hi\").
The response will be send in the same channel the custom command is send.

You can also remove a custom command with `/command custom remove <command title>`.
This time, you do not need to write it within double quotes if you have a command title containing multiple words.",
		"Command custom exists": "There already is a custom command with that name.",
		"Command custom added": "`{0}` was added as a custom command.",
		"Command custom none": "I could not find a custom command called `{0}`. Are you sure you typed it correctly?",
		"Command custom removed": "`{0}` was removed from the custom commands.",

		
		"Request default": "Send some information to me about your idea for a new feature or if you think something needs to be changed.",
		"Request feature": "Thanks for your submission.",
		"Request change": "Thanks for your submission.",

		
		"Restart default": "Restarting...",
		"Shutdown default": "Shutting down...",

		
		"Support default": "I'm sorry to hear you have problems with me. Come join my support server 'https://discord.gg/YFqUMDT'. Maybe someone there can help you.",

		
		"Welcome exception": "No welcome settings could be found. Please go to my support discord to have this fixed.",
		"Welcome enable": "I will now welcome any new member in {0}.",
		"Welcome disable": "The welcome message has now been disabled. You can still send a welcome message with my normal command.",
		"Welcome message default": "The welcome message for {2} is:
```
{1}
```
When setting your custom welcome message, you can use `{0}` as a variable where the mention of the user is placed.",
		"Welcome message set": "The welcome for {1} was changed to:
```
{0}
```",
		"Welcome image default": "I am currently set to {0} the standard welcome image.",
		"Welcome image use": "use",
		"Welcome image use not": "not use",
		"Welcome image enable": "The welcome image for {0} will be shown in welcome messages.",
		"Welcome image disable": "The welcome image for {0} will not be shown in welcome messages.",


		"Kick default": "Kick a user from the discord with `/kick <username/mention>`.",
		"Kick user": "Kicked user:",
		"Kick reason": "Reason:",
		"Kick reason none": "None",

		
		"Ban default": "You can ban a user from the discord with `/ban <username/mention> <optional: reason>`.
Enter a reason if you want to see later why that user was banned.

If you want a ban to be temporary, you can add the duration with `/ban <username/mention> <duration> <optional: reason>`.
Keep in mind this does not work on existing bans (yet).
The format for duration is `<number><optional: metric type>`.
The type can be of:
- s/sec/second/seconds/etc
- m/min/minute/minutes/etc
- h/hour/hours/etc
- d/day/days/etc
Example:
`/ban D-Kay 4h Spamming`",
		"Ban user": "User banned:",
		"Ban duration": "Banned until:",
		"Ban duration forever": "Forever",
		"Ban reason": "Reason:",
		"Ban reason none": "None",


		"Help no info": "I have no advanced information for that command (yet).",
		"Help title": "Here is a list of commands you can use.
I am constantly updated with new features so keep an eye on this page.",
		"Help general": "{0}help <command> - Show advanced help for a command.
{0}invite - Ask me for my invite link.
{0}support - Join this discord if you experience problems with me.
{0}pick <option1|option2|etc> - Select a random item from the options that are separated with |.
{0}birthday <username> - Sing a song for a happy fellow.
{0}kill <username> - Make me kill that user.",
		"Help praise title": "These are the commands for 'praise'.",
		"Help praise": "{0}praise <username> - Send a positive message to that user.
{0}praise someone - Send a positive message to a random person.
{0}praise everyone - Send a positive message to everyone.
{0}praise role <rolename> - Send a positive message to a group.",
		"Help music title": "These are the commands for 'music'.",
		"Help music": "{0}music join - Join the voice channel you're currently in.
{0}music move - Move to the voice channel you're currently in.
{0}music leave - Leave the voice channel I'm currently in.
{0}music play <name> - Search for a song by it's name and add it to the queue.
{0}music play <video url> - Add a song to the queue.
{0}music play <playlist url> - Add an entire playlist to the queue.
{0}music pause - Pause the currently playing song.
{0}music unpause - Un-pause the currently playing song.
{0}music playing - Show what song is currently playing.
{0}music queue - List all the songs in the queue.
{0}music volume <value> - Change my music volume. (admin only)
{0}music shuffle - Shuffle all the songs in the queue.
{0}music skip - Skip the song currently playing.
{0}music skip <amount> - Skip the given amount of songs.
{0}music clear - Remove all songs from the queue.
{0}music stop - Stop playing music and remove all songs from the queue.",
		"Help request title": "These are the commands for 'request'.",
		"Help request": "{0}request feature <message> - Send a message to my developer with the request for a new feature.
{0}request change <message> - Send a message to my developer with the request for a change of an already existing feature.",
		"Help admin": "{0}announce <message> - Announce a message to all members of your server.",
		"Help command title": "These are the commands for 'command'.",
		"Help command": "{0}command custom list - Show all custom commands for this server.",
		"Help command admin": "{0}command prefix - Show the command prefix for this server.
{0}command prefix set <new prefix> - Change the command prefix for this server.
{0}command custom - Show information about.
{0}command custom add <command title> <response> - Change the command prefix for this server.
{0}command custom remove <command title> - Change the command prefix for this server.",
		"Help language title": "These are the commands for 'language'.",
		"Help language": "{0}language - Show the currently displayed language.
{0}language set <language> - Change the command prefix for this server.",
		"Help welcome title": "These are the commands for 'welcome'.",
		"Help welcome": "{0}welcome <username, username, etc> - Send a welcome message to one or multiple users.
{0}welcome enable/on <textchannel> - Turn automated welcome messages on. Messages will be send in the provided text channel.
{0}welcome disable/off - Turn the automated welcome messages off.
{0}welcome message - Display the current welcome message.
{0}welcome message set <message> - Set a custom welcome message.
{0}welcome image - Display if the default image is being shown in welcome messages.
{0}welcome image enable/on - Set the default image to be shown in welcome messages.
{0}welcome image disable/off - Set the default image to not be shown in welcome messages.",
		"Help autochannel title": "These are the commands for 'autochannel'.",
		"Help autochannel": "{0}autochannel - Show information about autochannels.
{0}autochannel prefix - Show the current prefix for autochannels.
{0}autochannel prefix set <new prefix> - Change the prefix for autochannels.
{0}autochannel name - Show the current name for auto generated channels.
{0}autochannel name set <new name> - Change the name for auto  generated channels.
{0}autochannel delete - Deletes all voice channels that still have the name for auto generated channels.",
		"Help permachannel title": "These are the commands for 'permachannel'.",
		"Help permachannel": "{0}permachannel - Show information about permachannels.
{0}permachannel prefix - Show the current prefix for permachannels.
{0}permachannel prefix set <new prefix> - Change the prefix for permachannels.",
		"Help autorole title": "These are the commands for 'autorole'.",
		"Help autorole": "{0}autorole - Show information about autoroles.
{0}autorole prefix - Show the current prefix for autoroles.
{0}autorole prefix set <new prefix> - Change the prefix for autoroles.
{0}autorole ignore - Display your current status on ignoring automated roles.
{0}autorole ignore on - Turn your current status to ignore automated roles.
{0}autorole ignore off - Turn your current status to acceps automated roles.",
		"Help permarole title": "These are the commands for 'permarole'.",
		"Help permarole": "{0}permarole - Show information about permaroles.
{0}permarole prefix - Show the current prefix for permaroles.
{0}permarole prefix set <new prefix> - Change the prefix for permaroles.",
		"Help kick": "{0}kick <username/mention> - Kick specified user from the server.",
		"Help ban": "{0}ban - Give information about formatting the ban command.
{0}ban <username/mention> <optional: duration> <optional: reason> - Ban specified user from the server.",
  },
	"UserPraises": [
        "Good job, {0}. You deserve a :cookie:.",
        "{0}, you’re off to great places, today is your day. Your mountain is waiting, so get on your way.",
        "{0}, you’re braver than you believe, and stronger than you seem, and smarter than you think.",
        "If the world had more people like you {0}, it would be a better place. You do make a difference.",
        "you're a gift to those around you, {0}.",
        "{0}, you're a smart cookie.",
        "{0}, you are awesome!",
        "{0}, you have impeccable manners.",
        "{0}, you are the most perfect you there is.",
        "Your perspective is refreshing, {0}.",
        "{0}, you light up the room.",
        "{0}, you deserve a hug right now.",
        "You should be proud of yourself, {0}.",
        "{0}, you're more helpful than you realize.",
        "{0}, your kindness is a balm to all who encounter it.",
        "{0}, you're all that and a super-size bag of chips.",
        "On a scale from 1 to 10, you're an 11, {0}.",
        "{0}, you're even more beautiful on the inside than you are on the outside.",
        "{0}, you have the courage of your convictions.",
        "I'm inspired by you, {0}.",
        "{0}, you're like a ray of sunshine on a really dreary day.",
        "You are making a difference, {0}.",
        "{0}, your ability to recall random factoids at just the right time is impressive.",
        "You're a great listener, {0}.",
        "How is it that you always look great, even in sweatpants, {0}?",
        "Everything would be better if more people were like you, {0}!",
        "{0}, I bet you sweat glitter.",
        "You were cool way before hipsters were cool, {0}.",
        "That color is perfect on you, {0}.",
        "Hanging out with you is always a blast, {0}."
	],
	"GroupPraises": [
		"{0}, you are awesome!",
        "{0}, you're all smart cookies.",
        "{0}, you all deserve a hug right now.",
        "{0}, you're more helpful than you all realize.",
        "{0}, you all light up the room.",
        "I'm inspired by you all, {0}.",
        "Everything would be better if more people were like you all, {0}!",
        "You're all making a difference, {0}.",
        "You all should be proud of yourself, {0}."
	]
}